### List of Changed Stacks

```bash
dev/file
dev/random
```
<details>
<summary>Terraform Plan</summary>

```terraform
terramate: Entering stack in /stacks/dev/random
terramate: Executing command "terraform show -no-color out.tfplan"

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.random.random_string.name will be created
  + resource "random_string" "name" {
      + id               = (known after apply)
      + length           = 5
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "/@£$"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + random_name = (known after apply)
terramate: Entering stack in /stacks/dev/file
terramate: Executing command "terraform show -no-color out.tfplan"

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.file.local_file.my_file will be created
  + resource "local_file" "my_file" {
      + content              = "my file generated with terraform!!!"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./mocked-value.txt"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

<!-- Sticky Pull Request Commentterraform-plan -->